Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: $$ Cal comprovar que la fórmula anterior es compleix, encara que siga a llarg termini, abans de triar una estratègia de traducció per a la disseminació basada en la postedició.
es_es: $$ Hay que comprobar que la fórmula anterior se cumple, aunque sea a largo plazo, antes de elegir una estrategia de traducción para la diseminación basada en la postedición.

source: $ [_{{N}} ]$ (sense det)
es_es: $ [_{{N}} ]$ (sin det)

source: $R_1$: verb art nom $$ art nom verb
es_es: $R_1$: verbo art nombre $$ art nombre verbo

source: $R_2$: verb art nom adj $$ art nom adj verb
es_es: $R_2$: verbo art nombre adj $$ art nombre adj verbo

source: (*) CasCat és un sistema de traducció automàtica de l'espanyol al català que usa regles que reordenen seqüències de formes lèxiques segons les categories lèxiques.
es_es: (*) CasCat es un sistema de traducción automática del español al catalán que usa reglas que reordenan secuencias de formas léxicas según las categorías léxicas.

source: (*) Els sistemes de traducció automàtica entre dues llengües amb sintaxi similar no necessiten fer massa reordenaments perquè l'ordre dels mots no varia massa d'una llengua a altra.
es_es: (*) Los sistemas de traducción automática entre dos lenguas con sintaxis similar no necesitan hacer demasiados reordenamientos porque el orden de las palabras no varía demasiado de una lengua a otra.

source: (*) Per exemple, si $L$ és l'espanyol, mots com { escondite} poden referir-se a un lloc on amagar-se (1) o a un joc (2) (en $L'$=català, amagatall (1) i fet, { amagar}, fet a amagar o conillets a amagar (2)).
es_es: (*) Por ejemplo, si $L$ es el español, palabras como { escondite} pueden referirse a un lugar donde esconderse (1) o a un juego (2) (en $L'$=catalán, amagatall (1) y fet, { amagar}, fet a amagar o conillets a amagar (2)).

source: (*) Dues traduccions possibles del mot català cap a l'espanyol són cabe o cabeza.
es_es: (*) Dos traducciones posibles de la palabra catalana cap al espanyol son cabe o cabeza.

source: (*) Elegiu un idioma qualsevol que conegueu bé, $L$.
es_es: (*) Elegid un idioma cualquiera que conozcáis bien, $L$.

source: (*) En un corpus de textos en espanyol sobre economia de 925.461 mots estudiem quan apareixen mots conjuntament.
es_es: (*) En un corpus de textos en español sobre economía de 925.461 palabras estudiamos cuándo aparecen palabras conjuntamente.

source: (*) Estudieu els següents sintagmes nominals en maori (una llengua polinèsia parlada en Nova Zelanda):
es_es: (*) Estudiad los siguientes sintagmas nominales en maorí (una lengua polinesia hablada en Nueva Zelanda):

source: (*) Imagineu que sou part d'un equip de desenvolupament d'un sistema de traducció automàtica de l'anglés al català basat en l'estratègia de transferència morfològica avançada (apartat ).
es_es: (*) Imaginad que sois parte de un equipo de desarrollo de un sistema de traducción automática del inglés al catalán basado en la estrategia de transferencia morfológica avanzada (apartado ).

source: (*) Imagineu que teniu un sistema de traducció automàtica que treballa amb dues llengües, diguem-ne $A$ i $B$, en els dos sentits de traducció: $A{}B$ i $B{}A$, que traduïm un text origen $T$ en llengua $A$ a la llengua $B$ mitjançant aquest traductor automàtic, generant un text $T'$, i que després usem aquest mateix sistema per a traduir $T'$ de nou a la llengua $A$; anomenarem $T''$ el nou text en llengua $A$.
es_es: (*) Imaginad que tenéis un sistema de traducción automática que trabaja con dos lenguas, digamos $A$ y $B$, en los dos sentidos de traducción: $A{}B$ y $B{}A$, que traducimos un texto origen $T$ en lengua $A$ a la lengua $B$ mediante este traductor automático, generando un texto $T'$, y que después usamos este mismo sistema para traducir $T'$ de nuevo a la lengua $A$; denominaremos $T''$ el nuevo texto en lengua $A$.

source: (*) La traducció d'una oració es pot veure com una interpretació d'aquesta (és a dir, com l'expressió en la llengua meta del seu significat).
es_es: (*) La traducción de una oración se puede ver como una interpretación de esta (es decir, como la expresión en la lengua meta de su significado).

source: (a) (c), vegeu l'apartat .
es_es: (a) (c), mirad el apartado .

source: (b) (c) (b), vegeu l'apartat .
es_es: (b) (c) (b), véase el apartado .

source: (c) (c) (b) (a) (a) (c) Si la distribució dels mots fóra al atzar, la freqüència de tots els parells de mots seria la mateixa i molt baixa.
es_es: (c) (c) (b) (a) (a) (c) Si la distribución de las palabras fuera al azar, la frecuencia de todos los pares de palabras sería la misma y muy baja.

source: (correcte: cantell, viu) [Concordança de gènere o nombre]: [La] indicación era [inequívoca] $$ [La] indicació era [inequívoca]; [La] señal era [inequívoca] $$ [La] senyal era [inequívoca]$^*$ (correcte: el, inequívoc) [Anàfora:] Cualquier [indicación] es importante para quien la comprenda $$ Qualsevol [indicació] és important per a qui [la] comprenga; Cualquier [señal] es importante para quien la comprenda $$ Qualsevol [senyal] és important per a qui [la] comprenga.$^*$
es_es: (correcto: cantell, viu) [Concordancia de género o número]: [La] indicación era [inequívoca] $$ [La] indicació era [inequívoca]; [La] señal era [inequívoca] $$ [La] senyal era [inequívoca]$^*$ (correcte: el, inequívoc) [Anáfora:] Cualquier [indicación] es importante para quien la comprenda $$ Qualsevol [indicació] és important per a qui [la] comprenga; Cualquier [señal] es importante para quien la comprenda $$ Qualsevol [senyal] és important per a qui [la] comprenga.$^*$

source: (exemple pres de {carl01j}).
es_es: (ejemplo extraído de {carl01j}).

source: (només a tall d'exemple) Si la llengua origen és el català i la llengua meta és l'anglés, tenim: homografia mal resolta d'un mot: ara rius $$ now *rivers en comptes de now you laugh.
es_es: (sólo a modo de ejemplo) Si la lengua origen es el catalán y la lengua meta es el inglés, tenemos: homografía mal resuelta de una palabra: ara rius $$ now *rivers en vez de now you laugh.

source: (regles de reordenament i concordança)
es_es: (reglas de reordenamiento y concordancia)

source: (si no sabeu calcular-ho en general, feu els càlculs amb un text de, per exemple, 1000 mots).
es_es: (si no sabéis calcularlo en general, haced los cálculos con un texto de, por ejemplo, 1000 palabras).

source: *{ mi piace la latte fredda} (correcte: { mi piace il latte freddo}).
es_es: *{ mi piace la latte fredda} (correcto: { mi piace il latte freddo}).

source: *{ una senyal molt clara} (correcte: { un senyal molt clar}); cast. { me gusta la leche fría} $$ ital.
es_es: *{ una senyal molt clara} (correcto: { un senyal molt clar}); cast. { me gusta la leche fría} $$ ital.

source: Art.def.sg. casa gran .
es_es: Art.def.sg. casa grande .

source: Art.def.sg. casa gran de Art.def.sg. amor .
es_es: Art.def.sg. casa grande de Art.def.sg. amor .

source: Art.def.pl. casa gran .
es_es: Art.def.pl. casa grande .

source: Representació abstracta del text meta:
es_es: Representación abstracta del texto meta:

source: Text meta:
es_es: Texto meta:

source: n[lema="situació", nbr="pl", gen="f"],
es_es: n[lema="situación", nbr="pl", gen="f"],

source: Representació abstracta del text origen:
es_es: Representación abstracta del texto origen:

source: 4 de transferència, un d'anàlisi i un de generació 5 de transferència, un d'anàlisi i un de generació 8 de transferència, un d'anàlisi i un de generació
es_es: 4 de transferencia, uno de análisis y uno de generación 5 de transferencia, uno de análisis y uno de generación 8 de transferencia, uno de análisis y uno de generación

source: Anàlisi, generació i traducció.
es_es: Análisis, generación y traducción.

source: Assimilació; més concretament per a allò que es diu screening.
es_es: Asimilación; más concretamente para aquello que se llama screening.

source: D'interlingua amb 4 llengües (hem afegit la quinta).
es_es: De interlingua con 4 lenguas (hemos añadido la quinta).

source: Desavantatges d'interlingua: Vista la semblança sintàctica entre les llengües involucrades, sembla excessivament costós fer l'esforç de dissenyar una representació d'interlingua, fer l'anàlisi i la generació completa dels textos (lèxica, sintàctica, semàntica) quan una transferència morfològica completa i sintàctica parcial seria suficient.
es_es: Inconvenientes de interlingua: Visto el parecido sintáctico entre las lenguas involucradas, parece excesivamente costoso hacer el esfuerzo de diseñar una representación de interlingua, hacer el análisis y la generación completa de los textos (léxica, sintáctica, semántica) cuando una transferencia morfológica completa y sintáctica parcial sería suficiente.

source: Dos, un per a la fase d'anàlisi i un altre per a la de generació.
es_es: Dos, uno para la fase de análisis y otro para la de generación.

source: El de generació.
es_es: El de generación.

source: El de transferència.
es_es: El de transferencia.

source: Els arbres d'anàlisi sintàctica corresponents.
es_es: Los árboles de análisis sintáctico correspondientes.

source: Els de transferència morfològica avançada.
es_es: Los de transferencia morfológica avanzada.

source: Els llenguatges controlats defineixen regles de postedició.
es_es: Los lenguajes controlados definen reglas de postedición.

source: Els sistemes de transferència morfològica avançada.
es_es: Los sistemas de transferencia morfológica avanzada.

source: Els sistemes de transferència sintàctica fan anàlisi sintàctica sense fer anàlisi morfològica.
es_es: Los sistemas de transferencia sintáctica hacen análisis sintáctico sin hacer análisis morfológico.

source: En el d'anàlisi.
es_es: En el de análisis.

source: En la d'anàlisi.
es_es: En la de análisis.

source: En un sistema de transferència morfològica.
es_es: En un sistema de transferencia morfológica.

source: Joan usa el Web Translator mentre navega per les pàgines d'Internet de la Universität Mainz per a saber quina assignatura dóna el professor Karl-Hans Lehninger i quins són els seus interessos investigadors.
es_es: Joan usa el Web Translator mientras navega por las páginas de Internet de la Universität Mainz para saber qué asignatura da el profesor Karl-Hans Lehninger y cuáles son sus intereses investigadores.

source: L'obtenció de la forma lèxica d'un mot a partir de la forma superficial.
es_es: La obtención de la forma léxica de una palabra a partir de la forma superficial.

source: L'ús d'un llenguatge controlat L'ús d'un sistema d'interlingua.
es_es: El uso de un lenguaje controlado El uso de un sistema de interlingua.

source: La postedició en una aplicació d'assimilació.
es_es: La postedición en una aplicación de asimilación.

source: No, perquè els llenguatges controlats s'han de dissenyar independentment dels sistemes de TA.
es_es: No, porque los lenguajes controlados se tienen que diseñar independientemente de los sistemas de TA.

source: Per a evitar construccions o frases difícils de traduir.
es_es: Para evitar construcciones o frases difíciles de traducir.

source: Per a mesurar la versemblança (fluïdesa) de les traduccions.
es_es: Para medir la verosimilitud (fluidez) de las traducciones.

source: Posant-hi la traducció més probable, basada en les freqüències d'ús dels mots.
es_es: Poniendo la traducción más probable, basada en las frecuencias de uso de las palabras.

source: Preeditar el text original complet substituint la paraula per un sinònim que sí que reconega el traductor automàtic i tornar a traduir tot el text.
es_es: Preeditar el texto original completo sustituyendo la palabra por un sinónimo que sí que reconozca el traductor automático y volver a traducir todo el texto.

source: Que és especialment adequat per a l'assimilació, però no tant per a la disseminació en vista que els articles són més del 10% del text.
es_es: Que es especialmente adecuado para la asimilación, pero no tanto para la diseminación en vista de que los artículos son más del 10% del texto.

source: S'evita la necessitat que una persona interaccione amb el programa de traducció automàtica per a resoldre ambigüitats durant la traducció.
es_es: Se evita la necesidad de que una persona interaccione con el programa de traducción automática para resolver ambigüedades durante la traducción.

source: Set.
es_es: Siete.

source: T { A B}{}T'{ B A}{} T'' El text $T''$ serà previsiblement diferent del text $T$.
es_es: T { A B}{}T'{ B A}{} T'' El texto $T''$ será previsiblemente diferente del texto $T$.

source: D'altra banda, els sistemes de traducció automàtica basats en corpus (en anglés corpus-based machine translation).
es_es: Por otro lado, los sistemas de traducción automática basados en corpus (en inglés corpus-based machine translation).

source: La chica cuyos compañeros murieron es china { La noia els companys de la qual van morir és xinesa} La chica cuyos compañeros de clase murieron es china La noia els companys de classe de la qual van morir és xinesa La chica cuyos compañeros mayores murieron es china La noia els companys grans de la qual van morir és xinesa La chica cuyos compañeros de clase de francés murieron es china *La noia els companys de classe de la qual de francès van morir és xinesa (La noia els companys de classe de francès de la qual van morir és xinesa) La chica cuyos compañeros mayores de classe murieron es china *La noia els companys grans de la qual de classe van morir és xinesa (La noia els companys grans de classe de la qual van morir és xinesa) La chica cuyos compañeros mayores de clase de francés murieron es china *La noia els companys grans de la qual de classe de francès van morir és xinesa (La noia els companys grans de classe de francès de la qual van morir és xinesa) Les traduccions inacceptables estan marcades amb un asterisc.
es_es: La chica cuyos compañeros murieron es china { La noia els companys de la qual van morir és xinesa} La chica cuyos compañeros de clase murieron es china La noia els companys de classe de la qual van morir és xinesa La chica cuyos compañeros mayores murieron es china La noia els companys grans de la qual van morir és xinesa La chica cuyos compañeros de clase de francés murieron es china *La noia els companys de classe de la qual de francès van morir és xinesa (La noia els companys de classe de francès de la qual van morir és xinesa) La chica cuyos compañeros mayores de classe murieron es china *La noia els companys grans de la qual de classe van morir és xinesa (La noia els companys grans de classe de la qual van morir és xinesa) La chica cuyos compañeros mayores de clase de francés murieron es china *La noia els companys grans de la qual de classe de francès van morir és xinesa (La noia els companys grans de classe de francès de la qual van morir és xinesa) Las traducciones inaceptables están marcadas con un asterisco.

source: No, perquè els homògrafs del text origen no afecten el text meta en brut.
es_es: No, porque las palabras homógrafas del texto origen no afectan al texto meta en bruto.

source: Traducció automàtica assistida per la persona Traducció humana assistida per la màquina Usa un llenguatge controlat
es_es: Traducción automática asistida por la persona Traducción humana asistida por la máquina Usa un lenguaje controlado

source: Avantatges de transferència: Les llengües són prou similars perquè un sistema de transferència morfològica completa i sintàctica parcial amb poques regles done resultats acceptables.
es_es: Ventajas de transferencia: Las lenguas son bastante similares para que un sistema de transferencia morfológica completa y sintáctica parcial con pocas reglas dé resultados aceptables.

source: Aquestes tres fases s'esquematitzen en la figura .
es_es: Estas tres fases se esquematizan en la figura .

source: El sistema només ha usat dues seqüències (1: { art}--{ subst} i 2: { art}--{ subst}--{ adj}) per a intentar fer la concordança.
es_es: El sistema sólo ha usado dos secuencias (1: { art}--{ sust} y 2: { art}--{ sust}--{ adj}) para intentar hacer la concordancia.

source: $$ La gramàtica es ambigua, és a dir, capaç de generar dos arbres d'anàlisi sintàctica per a oracions com ara L'home porta la clau de l'armari gran.
es_es: $$ La gramática es ambigua, es decir, capaz de generar dos árboles de análisis sintáctico para oraciones como por ejemplo L'home porta la clau de l'armari gran.

source: [$R_2$:] detectar ``determinant nom adjectiu''; propagar el nombre (sing./pl.) del determinant maori (te/ng{a}) al nom i a l'adjectiu catalans; propagar el gènere (masc./fem.) del nom català al determinant i a l'adjectiu catalans.
es_es: [$R_2$:] detectar ``determinante nombre adjetivo''; propagar el número (sing./pl.) del determinante maorí (te/ng{a}) al nombre y al adjetivo catalanes; propagar el género (masc./fem.) del nombre catalán al determinante y al adjetivo catalanes.

source: Desavantatges de transferència: Per descomptat, cada vegada que s'afig una llengua a un sistema amb $N$ llengües s'han d'escriure $2N$ mòduls de transferència i calen experts bilingües per a construir-los tots.
es_es: Inconvenientes de transferencia: Por supuesto, cada vez que se añade una lengua a un sistema con $N$ lenguas se tienen que escribir $2N$ módulos de transferencia y hacen falta expertos bilingües para construirlos todos.

source: Quant als desavantatges, podem dir que: el disseny d'un llenguatge controlat no és gens trivial: cal estudiar amb profunditat corpus de textos pertanyents al domini i prendre decisions difícils; el poder d'expressió d'un llenguatge controlat és sempre més restringit; l'escriptura de textos en llenguatge controlat és més lenta; és necessària una inversió addicional de temps en l'aprenentatge del llenguatge controlat per part dels autors.
es_es: En cuanto a las desventajas, podemos decir que: el diseño de un lenguaje controlado no es nada trivial: hay que estudiar con profundidad corpus de textos pertenecientes al dominio y tomar decisiones difíciles; el poder de expresión de un lenguaje controlado es siempre más restringido; la escritura de textos en lenguaje controlado es más lenta; es necesaria una inversión adicional de tiempo en el aprendizaje del lenguaje controlado por parte de los autores.

source: Aquest és bàsicament el modus operandi dels sistemes d'interlingua (que es discutiran en la secció ) i constitueix l'aproximació composicional.
es_es: Este es básicamente el modus operandi de los sistemas deinterlingua (que se discutirán en la sección ) y constituye laaproximación composicional.

source: Els dos últims desavantatges es poden reduir si es dota els autors d'eines informàtiques, com ara d'un editor de textos intel·ligent que els ajude a escriure en el llenguatge controlat.
es_es: Las dos últimas desventajas se pueden reducir si se dota a los autores de herramientas informáticas, como por ejemplo de un editor de textos inteligente que los ayude a escribir en el lenguaje controlado.

source: Emetre un missatge d'error com més informatiu millor quan es detecte una violació de les especificacions del llenguatge.
es_es: Emitir un mensaje de error cuanto más informativo mejor cuando se detecte una violación de las especificaciones del lenguaje.

source: D'aquesta oració, l'analitzador sintàctic, només en veu la seqüència de categories lèxiques: det n v det n $$ L'anàlisi, pas a pas, és la següent: {l|r|l}
es_es: De esta oración, el analizador sintáctico, sólo ve la secuencia de categorías léxicas: det n v det n $$ El análisis, paso a paso, es el siguiente: {l|r|l}

source: El procés es pot resumir en l'alineament següent: a n g o i x a v e n a n g o ixa - - r<verb><imp> - <3p><pl> Si la forma superficial haguera estat angostes, tot el procés fins a ango- hauria estat idèntic.
es_es: El proceso se puede resumir en el alineamiento siguiente: a n g o i x a v e n a n g o ixa - - r<verb><imp> - <3p><pl> Si la forma superficial hubiera sido angostes, todo el proceso hasta ango-habría sido idéntico.

source: Com es pot veure, els desenvolupaments tècnics fets al voltant del disseny d'un llenguatge controlat es relacionen amb molts conceptes que es tracten en aquest llibre.
es_es: Como se puede ver, los desarrollos técnicos hechos alrededor del diseño de un lenguaje controlado se relacionan con muchos conceptos que se tratan en este libro.

source: La semàntica de totes aquestes frases es podria resumir en l'estructura abstracta donarplaer(agent=nadar(agent=jo),experimentador=jo).
es_es: La semántica de todas estas frases se podría resumir en la estructura abstracta donarplaer(agente=nadar(agente=jo),experimentador=jo).

source: La noció de portar un nom també sol expressar-se de manera sintàcticament divergent.
es_es: La noción de portar un nom también suele expresarse de manera sintácticamente divergente.

source: } {Fase d'anàlisi d'un sistema senzill de transferència morfològica avançada.
es_es: } {Fase de análisis de un sistema sencillo de transferencia morfológica avanzada.

source: Els sistemes de traducció automàtica per interlingua (apartat ).
es_es: Los sistemas de traducción automática por interlingua (apartado ).

source: {10cm}{ TRANSFERÈNCIA} {{10cm}{ {{9cm}{ Transferència lèxica:
es_es: {10cm}{ TRANSFERENCIA} {{10cm}{ {{9cm}{ Transferencia léxica:

source: { les situacions complexes } } {Fase de generació d'un sistema senzill de transferència morfològica avançada }
es_es: { las situaciones complejas } } {Fase de generación de un sistema sencillo de transferencia morfológica avanzada }

source: Crear un nou mòdul de generació ($G_4$).
es_es: Crear un nuevo módulo de generación ($G_4$).

source: El mòdul de transferència és un mòdul bilingüe que llig la RATO i genera una altra representació abstracta similar, però per a la LM, la representació abstracta del text meta (RATM).
es_es: El módulo de transferencia es un módulo bilingüe que lee la RATO y genera otra representación abstracta similar, pero para la LM, la representación abstracta del texto meta (RATM).

source: La traducció immediata de documents durant la navegació per Internet (de fet, hi ha programes especialment dissenyats per a aquesta finalitat, com ara Google Translate o Bing Translator).
es_es: La traducción inmediata de documentos durante la navegación por Internet (de hecho, hay programas diseñados especialmente para esta finalidad, como Google Translate o Bing Translator).

source: Quan hem llegit ango- el ventall de possibilitats es fa més estret: pot ser una forma d'angoixa, d'angoixar o d'angost.
es_es: Cuando leemos ango- el abanico de posibilidades se hace más estrecho: puede ser una forma de angoixa, de angoixar o de angost.

source: [Ponderació lèxica:] Els segments usats per traduir poden ser molt llargs (normalment fins a 7 paraules), la qual cosa fa molt difícil estimar bé la seua probabilitat de traducció perquè els segments llargs solen aparéixer poques vegades en els corpus d'entrenament; això fa necessari l'ús d'un altre model per estimar la qualitat dels segments bilingües.
es_es: [Ponderación léxica:] Los segmentos usados para traducir pueden ser muy largos (normalmente hasta 7 palabras), lo que hace muy difícil estimar bien su probabilidad de traducción porque los segmentos largos suelen aparecer pocas veces en los corpus de entrenamiento; esto hace necesario el uso de otro modelo para estimar la calidad de los segmentos bilingües.

source: {{9cm}{ Desambiguació categorial
es_es: {{9cm}{ Desambiguación categorial

source: ... produeix, per a cada mot, totes les formes superficials corresponents.
es_es: ... produce, para cada palabra, todas las formas superficiales correspondientes.

source: ... és una alternativa a la postedició, que elimina completament aquesta última fase.
es_es: ... es una alternativa a la postedición, que elimina completamente esta última fase.
